stress_stest/stressMeOut.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: "Warm up the application"
    - duration: 20
      arrivalRate: 30
      name: "Sustained high load"
    - duration: 3
      arrivalRate: 2000
      name: "Spikes in service load"
  processor: "./randomUrl.js"

scenarios:
  - name: "Go to random URL"
    flow:
      - function: "generateRandomData"
      - get:
          url: "/restaurants/{{ id }}"
      - log: "Sent a request to /restaurants/{{ id }}"
      - get:
          url: "/restaurants/{{ id }}/bundle.js"
      - log: "Sent a request to /restaurants/{{ id }}/bundle.js"
      - get:
          url: "/api/restaurants/{{ id }}/gallery"
      - log: "Sent a request to /api/restaurants/{{ id }}/gallery"